Tekla.Structures.TeklaStructuresInternal.MateriaClient.IGraph
Graph interface
Tekla.Structures.TeklaStructuresInternal.MateriaClient.IGraph
The following example shows how to use the IGraph functionalities
using System;
using Tekla.Structures.TeklaStructuresInternal.MateriaClient;
public class MateriaGraphExample
{
private IGraph graph;
public MateriaGraphExample(IGraph graph)
{
this.graph = graph;
}
// Gets and sets the graph parameters
public void GetAndSetGraphParameters()
{
var graphParameters = graph.GetParameterList();
graphParameters[0] = new GraphParameter() { Name = "PropName", Value = "NewValue" };
graph.SetParameterList(graphParameters);
}
// Gets the TrimBIM geometry to the specified filepath
public async void GetTrimBimToFile(string filePath)
{
await graph.GetTrimBimToFile(filePath);
}
}

Tekla.Structures.TeklaStructuresInternal.MateriaClient.IGraph.GraphComputed
Event for notifying about graph computations finished

Tekla.Structures.TeklaStructuresInternal.MateriaClient.IGraph.Asset
Gets asset for which this graph was loaded

Tekla.Structures.TeklaStructuresInternal.MateriaClient.IGraph.GetParameterList
Gets the parameters for the graph.

Tekla.Structures.TeklaStructuresInternal.MateriaClient.IGraph.SetParameterList(System.Collections.Generic.List{Tekla.Structures.TeklaStructuresInternal.MateriaClient.GraphParameter})
Set the parameter list to the graph.
graphParameters: The list of parameters

Tekla.Structures.TeklaStructuresInternal.MateriaClient.IGraph.GetTrimBimToFile(System.String)
Retrieves the geometry as TrimBIM and writes it to the specified file.
path: The path where the TrimBIM is written.
Returns: True if the TrimBIM is written to the file, false otherwise.